## Plan Result (test-frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
* Delete
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-service-web&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test"
        name                                         = "sdshmcts-test"
        tags                                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (14 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-vh-service-web" -> "healthProbeSettings-sds-api-mgmt"
            id                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/backendPools/vh-service-web"
          ~ load_balancing_name = "loadBalancingSettings-vh-service-web" -> "loadBalancingSettings-sds-api-mgmt"
          ~ name                = "vh-service-web" -> "sds-api-mgmt"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-sdstest.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-sdsapimgmttest.uksouth.cloudapp.azure.com"
              ~ host_header = "vh-service-web.test.platform.hmcts.net" -> "sds-api-mgmt.test.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sds-api-mgmt" -> "healthProbeSettings-portal-test"
            id                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/backendPools/sds-api-mgmt"
          ~ load_balancing_name = "loadBalancingSettings-sds-api-mgmt" -> "loadBalancingSettings-portal-test"
          ~ name                = "sds-api-mgmt" -> "portal-test"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-sdsapimgmttest.uksouth.cloudapp.azure.com" -> "pre-testing.powerappsportals.com"
              ~ host_header = "sds-api-mgmt.test.platform.hmcts.net" -> "portal-test.pre-recorded-evidence.justice.gov.uk"
                # (5 unchanged attributes hidden)
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-portal-test" -> null
          - id                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/backendPools/portal-test" -> null
          - load_balancing_name = "loadBalancingSettings-portal-test" -> null
          - name                = "portal-test" -> null

          - backend {
              - address     = "pre-testing.powerappsportals.com" -> null
              - enabled     = true -> null
              - host_header = "portal-test.pre-recorded-evidence.justice.gov.uk" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/healthProbeSettings/healthProbeSettings-vh-service-web"
          ~ name                = "healthProbeSettings-vh-service-web" -> "healthProbeSettings-sds-api-mgmt"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/healthProbeSettings/healthProbeSettings-sds-api-mgmt"
          ~ name                = "healthProbeSettings-sds-api-mgmt" -> "healthProbeSettings-portal-test"
          ~ path                = "/health/liveness" -> "/SignIn?ReturnUrl=%2F"
          ~ protocol            = "Http" -> "Https"
            # (3 unchanged attributes hidden)
        }
      - backend_pool_health_probe {
          - enabled             = true -> null
          - id                  = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/healthProbeSettings/healthProbeSettings-portal-test" -> null
          - interval_in_seconds = 120 -> null
          - name                = "healthProbeSettings-portal-test" -> null
          - path                = "/SignIn?ReturnUrl=%2F" -> null
          - probe_method        = "GET" -> null
          - protocol            = "Https" -> null
        }

      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/loadBalancingSettings/loadBalancingSettings-vh-service-web"
          ~ name                            = "loadBalancingSettings-vh-service-web" -> "loadBalancingSettings-sds-api-mgmt"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/loadBalancingSettings/loadBalancingSettings-sds-api-mgmt"
          ~ name                            = "loadBalancingSettings-sds-api-mgmt" -> "loadBalancingSettings-portal-test"
            # (3 unchanged attributes hidden)
        }
      - backend_pool_load_balancing {
          - additional_latency_milliseconds = 0 -> null
          - id                              = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/loadBalancingSettings/loadBalancingSettings-portal-test" -> null
          - name                            = "loadBalancingSettings-portal-test" -> null
          - sample_size                     = 4 -> null
          - successful_samples_required     = 2 -> null
        }

      ~ frontend_endpoint {
          ~ host_name                               = "vh-service-web.test.platform.hmcts.net" -> "sds-api-mgmt.test.platform.hmcts.net"
            id                                      = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/frontendEndpoints/vh-service-web"
          ~ name                                    = "vh-service-web" -> "sds-api-mgmt"
          ~ web_application_firewall_policy_link_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhservicewebtest" -> "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sdsapimgmttest"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "sds-api-mgmt.test.platform.hmcts.net" -> "portal-test.pre-recorded-evidence.justice.gov.uk"
            id                                      = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/frontendEndpoints/sds-api-mgmt"
          ~ name                                    = "sds-api-mgmt" -> "portal-test"
          ~ web_application_firewall_policy_link_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sdsapimgmttest" -> "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/portaltesttest"
            # (2 unchanged attributes hidden)
        }
      - frontend_endpoint {
          - host_name                               = "portal-test.pre-recorded-evidence.justice.gov.uk" -> null
          - id                                      = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/frontendEndpoints/portal-test" -> null
          - name                                    = "portal-test" -> null
          - session_affinity_enabled                = false -> null
          - session_affinity_ttl_seconds            = 0 -> null
          - web_application_firewall_policy_link_id = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/portaltesttest" -> null
        }

      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-service-web",
              + "sds-api-mgmt",
            ]
            id                 = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/routingRules/vh-service-web"
          ~ name               = "vh-service-web" -> "sds-api-mgmt"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "vh-service-web" -> "sds-api-mgmt"
              ~ cache_enabled                         = true -> false
                # (3 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sds-api-mgmt",
              + "portal-test",
            ]
            id                 = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/routingRules/sds-api-mgmt"
          ~ name               = "sds-api-mgmt" -> "portal-test"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "sds-api-mgmt" -> "portal-test"
              ~ forwarding_protocol                   = "HttpOnly" -> "HttpsOnly"
                # (3 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
              - "Https",
              + "Http",
            ]
          ~ frontend_endpoints = [
              - "portal-test",
              + "toffee",
            ]
            id                 = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/routingRules/portal-test"
          ~ name               = "portal-test" -> "toffeeHttpsRedirect"
            # (2 unchanged attributes hidden)

          - forwarding_configuration {
              - backend_pool_name                     = "portal-test" -> null
              - cache_enabled                         = false -> null
              - cache_query_parameter_strip_directive = "StripNone" -> null
              - cache_use_dynamic_compression         = false -> null
              - forwarding_protocol                   = "HttpsOnly" -> null
            }

          + redirect_configuration {
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "toffee",
              + "pip-frontend",
            ]
            id                 = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/routingRules/toffeeHttpsRedirect"
          ~ name               = "toffeeHttpsRedirect" -> "pip-frontendHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pip-frontend",
              + "vh-test-web",
            ]
            id                 = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/routingRules/pip-frontendHttpsRedirect"
          ~ name               = "pip-frontendHttpsRedirect" -> "vh-test-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-test-web",
              + "vh-video-web",
            ]
            id                 = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/routingRules/vh-test-webHttpsRedirect"
          ~ name               = "vh-test-webHttpsRedirect" -> "vh-video-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-video-web",
              + "vh-admin-web",
            ]
            id                 = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/routingRules/vh-video-webHttpsRedirect"
          ~ name               = "vh-video-webHttpsRedirect" -> "vh-admin-webHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-admin-web",
              + "sds-api-mgmt",
            ]
            id                 = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/routingRules/vh-admin-webHttpsRedirect"
          ~ name               = "vh-admin-webHttpsRedirect" -> "sds-api-mgmtHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "vh-service-web",
              + "portal-test",
            ]
            id                 = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/routingRules/vh-service-webHttpsRedirect"
          ~ name               = "vh-service-webHttpsRedirect" -> "portal-testHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "sds-api-mgmt",
            ] -> null
          - id                 = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/routingRules/sds-api-mgmtHttpsRedirect" -> null
          - name               = "sds-api-mgmtHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "portal-test",
            ] -> null
          - id                 = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test/routingRules/portal-testHttpsRedirect" -> null
          - name               = "portal-testHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }

        # (31 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-service-web"] will be destroyed
  # (because key ["vh-service-web"] is not in for_each map)
  - resource "azurerm_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [
          - "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourcegroups/lz-test-rg/providers/Microsoft.Network/frontdoors/sdshmcts-test/frontendendpoints/vh-service-web",
        ] -> null
      - id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhservicewebtest" -> null
      - location                          = "global" -> null
      - mode                              = "Prevention" -> null
      - name                              = "vhservicewebtest" -> null
      - resource_group_name               = "lz-test-rg" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Medium"
          - "environment"  = "testing"
        } -> null

      - managed_rule {
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 2 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":335,"Program":"tfcmt","SHA1":"","Target":"test-frontdoor","Vars":{}} -->